ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc4_eru_map.h
#if (UC_DEVICE == XMC4504) && (UC_PACKAGE == LQFP144)
#define ERU0_ETL0_INPUTA_P0_1               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL0_INPUTA_P2_5               XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL0_INPUTA_P3_2               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL0_INPUTA_SCU_G0ORCOUT6      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL0_INPUTB_P0_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL0_INPUTB_P2_0               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL0_INPUTB_P2_4               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL0_INPUTB_P3_1               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL1_INPUTA_P0_10              XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL1_INPUTA_P2_3               XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL1_INPUTA_SCU_G0ORCOUT7      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL1_INPUTA_SCU_HIB_SR0        XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL1_INPUTB_P0_9               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL1_INPUTB_P2_2               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL1_INPUTB_P2_6               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL1_INPUTB_SCU_HIB_SR1        XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTA_P0_13              XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL2_INPUTA_P0_8               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL2_INPUTA_P1_5               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL2_INPUTA_SCU_G1ORCOUT6      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL2_INPUTB_P0_12              XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL2_INPUTB_P0_4               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL2_INPUTB_P0_7               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTB_P1_4               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTA_P0_11              XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL3_INPUTA_P1_1               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL3_INPUTA_P3_6               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL3_INPUTA_SCU_G1ORCOUT7      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL3_INPUTB_P0_2               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL3_INPUTB_P0_6               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL3_INPUTB_P1_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTB_P3_5               XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL0_INPUTA_CCU40_ST0          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL0_INPUTA_DAC_SGN_0          XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL0_INPUTA_P1_5               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL0_INPUTA_POSIF0_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL0_INPUTB_CCU80_ST0          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL0_INPUTB_ERU1_IOUT3         XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL0_INPUTB_P2_1               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL0_INPUTB_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL1_INPUTA_CCU40_ST1          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL1_INPUTA_ERU1_IOUT2         XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL1_INPUTA_P1_15              XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL1_INPUTA_POSIF0_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL1_INPUTB_CCU80_ST1          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL1_INPUTB_ERU1_IOUT2         XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL1_INPUTB_P2_7               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL1_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL2_INPUTA_CCU40_ST2          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL2_INPUTA_DAC_SGN_1          XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL2_INPUTA_P1_3               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL2_INPUTA_POSIF1_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL2_INPUTB_CCU80_ST2          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL2_INPUTB_P1_2               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL2_INPUTB_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL3_INPUTA_CCU40_ST3          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL3_INPUTA_P0_5               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL3_INPUTA_POSIF1_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL3_INPUTB_CCU80_ST3          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL3_INPUTB_P0_3               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL3_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B2

#define ERU0_OGU0_PERIPHERAL_TRIGGER_FIXH   XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU0_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU0_OGU1_PERIPHERAL_TRIGGER_FIXH   XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU1_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU0_OGU2_PERIPHERAL_TRIGGER_FIXH   XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU2_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU0_OGU3_PERIPHERAL_TRIGGER_FIXH   XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU0_OGU3_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU1_OGU0_PERIPHERAL_TRIGGER_CCU40_ST0  XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU0_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU1_OGU0_PERIPHERAL_TRIGGER_VADC_C0SR0 XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU1_PERIPHERAL_TRIGGER_CCU41_ST0  XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU1_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU1_OGU1_PERIPHERAL_TRIGGER_VADC_C0SR1 XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU2_PERIPHERAL_TRIGGER_CCU81_STA3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU2_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU1_OGU2_PERIPHERAL_TRIGGER_VADC_C0SR2 XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#define ERU1_OGU3_PERIPHERAL_TRIGGER_CCU81_STB3 XMC_ERU_OGU_PERIPHERAL_TRIGGER2
#define ERU1_OGU3_PERIPHERAL_TRIGGER_FIXL   XMC_ERU_OGU_PERIPHERAL_TRIGGER3
#define ERU1_OGU3_PERIPHERAL_TRIGGER_VADC_C0SR3 XMC_ERU_OGU_PERIPHERAL_TRIGGER1
#endif


#if (UC_DEVICE == XMC4700) && (UC_PACKAGE == BGA196)
#define ERU0_ETL0_INPUTA_P0_1               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL0_INPUTA_P2_5               XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL0_INPUTA_P3_2               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL0_INPUTA_SCU_G0ORCOUT6      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL0_INPUTB_P0_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL0_INPUTB_P2_0               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL0_INPUTB_P2_4               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL0_INPUTB_P3_1               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL1_INPUTA_P0_10              XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL1_INPUTA_P2_3               XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL1_INPUTA_SCU_G0ORCOUT7      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL1_INPUTA_SCU_HIB_SR0        XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL1_INPUTB_P0_9               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL1_INPUTB_P2_2               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL1_INPUTB_P2_6               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL1_INPUTB_SCU_HIB_SR1        XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTA_P0_13              XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL2_INPUTA_P0_8               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL2_INPUTA_P1_5               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL2_INPUTA_SCU_G1ORCOUT6      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL2_INPUTB_P0_12              XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL2_INPUTB_P0_4               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL2_INPUTB_P0_7               XMC_ERU_ETL_INPUT_B1
#define ERU0_ETL2_INPUTB_P1_4               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTA_P0_11              XMC_ERU_ETL_INPUT_A2
#define ERU0_ETL3_INPUTA_P1_1               XMC_ERU_ETL_INPUT_A0
#define ERU0_ETL3_INPUTA_P3_6               XMC_ERU_ETL_INPUT_A1
#define ERU0_ETL3_INPUTA_SCU_G1ORCOUT7      XMC_ERU_ETL_INPUT_A3
#define ERU0_ETL3_INPUTB_P0_2               XMC_ERU_ETL_INPUT_B3
#define ERU0_ETL3_INPUTB_P0_6               XMC_ERU_ETL_INPUT_B2
#define ERU0_ETL3_INPUTB_P1_0               XMC_ERU_ETL_INPUT_B0
#define ERU0_ETL3_INPUTB_P3_5               XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL0_INPUTA_CCU40_ST0          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL0_INPUTA_DAC_SGN_0          XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL0_INPUTA_P1_5               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL0_INPUTA_POSIF0_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL0_INPUTB_CCU80_ST0          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL0_INPUTB_ERU1_IOUT3         XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL0_INPUTB_P2_1               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL0_INPUTB_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL1_INPUTA_CCU40_ST1          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL1_INPUTA_ERU1_IOUT2         XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL1_INPUTA_P1_15              XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL1_INPUTA_POSIF0_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL1_INPUTB_CCU80_ST1          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL1_INPUTB_ERU1_IOUT2         XMC_ERU_ETL_INPUT_B3
#define ERU1_ETL1_INPUTB_P2_7               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL1_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL2_INPUTA_CCU40_ST2          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL2_INPUTA_DAC_SGN_1          XMC_ERU_ETL_INPUT_A3
#define ERU1_ETL2_INPUTA_P1_3               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL2_INPUTA_POSIF1_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL2_INPUTB_CCU80_ST2          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL2_INPUTB_P1_2               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL2_INPUTB_VADC0_G0BFLOUT3    XMC_ERU_ETL_INPUT_B2
#define ERU1_ETL3_INPUTA_CCU40_ST3          XMC_ERU_ETL_INPUT_A2
#define ERU1_ETL3_INPUTA_P0_5               XMC_ERU_ETL_INPUT_A0
#define ERU1_ETL3_INPUTA_POSIF1_SR1         XMC_ERU_ETL_INPUT_A1
#define ERU1_ETL3_INPUTB_CCU80_ST3          XMC_ERU_ETL_INPUT_B1
#define ERU1_ETL3_INPUTB_P0_3               XMC_ERU_ETL_INPUT_B0
#define ERU1_ETL3_INPUTB_VADC0_G1BFLOUT3    XMC_ERU_ETL_INPUT_B2

